[
  {"title":"Evergreen Tailored Blazer","description":"Crafted from regenerative wool woven in small Italian mills. Naturally dyed using plant-based pigments for a refined matte finish. Designed for longevity with reinforced seams and timeless tailoring.","stock":32,"category":"Men Fashion","price":420},
  {"title":"Tideweave Linen Shirt","description":"Lightweight, breathable linen sourced from water-efficient farms. Soft-washed for comfort without chemical softeners. Ideal for both smart-casual and warm-weather formal wear.","stock":58,"category":"Men Fashion","price":185},
  {"title":"Solstice Organic Cotton Tee","description":"Made from 100% GOTS-certified organic cotton. Naturally dyed in small batches to minimize waste. Relaxed fit with structured shoulders for a modern silhouette.","stock":120,"category":"Men Fashion","price":95},
  {"title":"Atlas Recycled Wool Trousers","description":"Blended from post-consumer recycled wool fibers. Tailored with a clean, straight-leg profile. Breathable, durable, and wrinkle-resistant for all-day wear.","stock":41,"category":"Men Fashion","price":310},
  {"title":"Horizon Hemp Overshirt","description":"Built from durable, naturally antimicrobial hemp fabric. Washed with eco-friendly enzymes for softness. Perfect as a layering piece across seasons.","stock":67,"category":"Men Fashion","price":260},
  {"title":"Nordic Merino Knit","description":"Fine-gauge sweater made from ethically sourced merino wool. Temperature-regulating and breathable for year-round comfort. Minimalist ribbed detailing at cuffs and hem.","stock":54,"category":"Men Fashion","price":340},
  {"title":"Pebblewash Denim Jacket","description":"Made from low-impact, water-reduced denim. Dyed using indigo-free technology to reduce chemical runoff. Classic trucker fit with sustainable metal buttons.","stock":39,"category":"Men Fashion","price":375},
  {"title":"Nimbus Recycled Puffer Vest","description":"Filled with recycled ocean plastic insulation. Lightweight yet exceptionally warm. Finished with a PFC-free water-repellent coating.","stock":28,"category":"Men Fashion","price":410},
  {"title":"Cedar Vegan Leather Loafers","description":"Made from plant-based leather alternatives. Breathable lining crafted from recycled fibers. Designed for comfort without sacrificing formal elegance.","stock":46,"category":"Men Fashion","price":290},
  {"title":"Verdant Bamboo Chinos","description":"Soft, breathable bamboo-blend fabric with natural stretch. Dyed using low-impact methods to conserve water. Clean, tailored fit suitable for office or weekend wear.","stock":72,"category":"Men Fashion","price":255},
  {"title":"Cascade Alpaca Coat","description":"Handwoven alpaca wool sourced from ethical cooperatives. Naturally insulating while remaining lightweight. Minimalist design with hidden corozo buttons.","stock":18,"category":"Men Fashion","price":980},
  {"title":"Urban Recycled Knit Hoodie","description":"Spun from recycled polyester and organic cotton. Soft brushed interior for comfort. Reinforced stitching for durability in everyday wear.","stock":102,"category":"Men Fashion","price":165},
  {"title":"Marina Tencel Polo","description":"Made from sustainably harvested eucalyptus fibers. Naturally moisture-wicking and smooth to the touch. Smart-casual silhouette with a refined collar.","stock":88,"category":"Men Fashion","price":150},
  {"title":"Boreal Tailored Overcoat","description":"Constructed from recycled wool blends. Wind-resistant lining made from recycled nylon. Structured shoulders with a modern, streamlined cut.","stock":22,"category":"Men Fashion","price":760},
  {"title":"Sandrift Organic Sweatpants","description":"Premium loopback fabric made from organic cotton. Naturally dyed with minimal water usage. Relaxed fit with an elastic waistband and drawcord.","stock":130,"category":"Men Fashion","price":145},
  {"title":"Canopy Hemp Blazer","description":"Lightweight blazer woven from hemp and organic cotton. Breathable and naturally wrinkle-resistant. Soft-shoulder construction for a contemporary look.","stock":34,"category":"Men Fashion","price":520},
  {"title":"Forge Reclaimed Denim Jeans","description":"Made from reclaimed denim scraps re-spun into new yarn. Low-water finishing process reduces environmental impact. Slim-straight fit with classic five-pocket styling.","stock":61,"category":"Men Fashion","price":285},
  {"title":"Seren Merino Scarf","description":"Ultra-soft merino sourced from cruelty-free farms. Naturally dyed in earthy tones. Lightweight yet warm for versatile layering.","stock":140,"category":"Men Fashion","price":130},
  {"title":"Atlas Cork Belt","description":"Made from sustainably harvested cork. Naturally flexible, durable, and water-resistant. Polished stainless buckle with a minimalist design.","stock":95,"category":"Men Fashion","price":110},
  {"title":"Riverstone Linen Suit","description":"Breathable linen suit woven in small artisanal mills. Naturally dyed using plant-based pigments. Relaxed tailoring perfect for summer formal occasions.","stock":15,"category":"Men Fashion","price":1150},
  {"title":"Summit Recycled Parka","description":"Shell made from recycled polyester bottles. Insulated with responsibly sourced down alternatives. Finished with a PFC-free water-resistant treatment.","stock":19,"category":"Men Fashion","price":890},
  {"title":"Harbor Organic Oxford Shirt","description":"Classic button-down made from organic cotton oxford. Low-impact dyeing minimizes environmental footprint. Structured collar with mother-of-pearl buttons.","stock":77,"category":"Men Fashion","price":210},
  {"title":"Sable Tencel Trench","description":"Smooth, drapey fabric derived from sustainably managed forests. Naturally breathable with a subtle sheen. Double-breasted silhouette with recycled hardware.","stock":23,"category":"Men Fashion","price":940},
  {"title":"Prairie Wool Flannel Shirt","description":"Soft brushed flannel made from recycled wool fibers. Naturally warm and breathable. Versatile layer that works dressed up or down.","stock":56,"category":"Men Fashion","price":275},
  {"title":"Nimbus Lightweight Down Jacket","description":"Filled with traceable, ethically sourced down. Shell made from recycled nylon. Packs easily for travel without bulk.","stock":27,"category":"Men Fashion","price":610},
  {"title":"Mesa Organic Cotton Chore Jacket","description":"Durable canvas woven from organic fibers. Naturally dyed to reduce chemical waste. Multiple utility pockets with a minimalist aesthetic.","stock":38,"category":"Men Fashion","price":395},
  {"title":"Delta Bamboo Socks Set","description":"Made from breathable bamboo fibers with natural antibacterial properties. Reinforced heel and toe for longevity. Comes in a neutral three-pack.","stock":220,"category":"Men Fashion","price":48},
  {"title":"Slate Recycled Nylon Bomber","description":"Outer fabric made from regenerated fishing nets. Lightweight insulation for transitional weather. Ribbed collar, cuffs, and hem for a clean finish.","stock":35,"category":"Men Fashion","price":480},
  {"title":"Lagoon Organic Swim Shorts","description":"Fabric made from recycled ocean plastic. Quick-drying with a soft inner mesh. Finished with eco-friendly dye processes.","stock":84,"category":"Men Fashion","price":165},
  {"title":"Granite Wool Knit Polo","description":"Fine merino knit with a structured collar. Naturally temperature-regulating and breathable. Modern slim fit suitable for smart-casual settings.","stock":49,"category":"Men Fashion","price":360},
  {"title":"Valley Recycled Cotton Sweatshirt","description":"Made from pre-consumer cotton waste. Soft interior with a durable outer face. Minimal branding for a timeless look.","stock":112,"category":"Men Fashion","price":170},
  {"title":"Sirocco Linen Trousers","description":"Tailored from breathable European linen. Naturally dyed with low water consumption. Crisp pleats and a clean tapered leg.","stock":44,"category":"Men Fashion","price":320},
  {"title":"Canyon Suede Derby Shoes","description":"Made from responsibly sourced suede. Vegetable-tanned leather lining for reduced chemical use. Cushioned insole for all-day comfort.","stock":29,"category":"Men Fashion","price":550},
  {"title":"Everlight Merino Base Layer","description":"Ultra-fine merino wool knit for comfort. Naturally odor-resistant and moisture-wicking. Seamless construction to prevent chafing.","stock":90,"category":"Men Fashion","price":210},
  {"title":"Drift Organic Bucket Hat","description":"Made from certified organic cotton twill. Naturally dyed in earth tones. Lightweight and packable for travel.","stock":150,"category":"Men Fashion","price":95},
  {"title":"Alpine Recycled Fleece Jacket","description":"Fabric made from recycled plastic bottles. Soft, breathable, and highly insulating. Zippered pockets lined with recycled mesh.","stock":64,"category":"Men Fashion","price":340},
  {"title":"Harbor Knit Blazer","description":"Knitted blazer made from organic cotton blend. Stretchy yet structured for comfort. Ideal for modern smart-casual dressing.","stock":26,"category":"Men Fashion","price":510},
  {"title":"Dune Organic Twill Shorts","description":"Soft yet durable organic cotton twill. Naturally dyed with minimal water usage. Relaxed fit with reinforced stitching.","stock":101,"category":"Men Fashion","price":155},
  {"title":"Arbor Merino Beanie","description":"Rib-knit beanie made from fine merino wool. Naturally insulating without overheating. Minimalist design with a rolled cuff.","stock":180,"category":"Men Fashion","price":85},
  {"title":"Horizon Tailored Vest","description":"Made from recycled wool blends. Lined with breathable recycled polyester. Sharp tailoring suitable for layered formal looks.","stock":21,"category":"Men Fashion","price":260},
  {"title":"Vela Bamboo Pyjama Set","description":"Soft, breathable bamboo fabric for temperature regulation. Naturally hypoallergenic and gentle on skin. Minimalist design with relaxed fit.","stock":73,"category":"Men Fashion","price":195},
  {"title":"Northwind Wool Peacoat","description":"Constructed from recycled wool yarns. Double-breasted silhouette with durable corozo buttons. Fully lined with recycled fabric for warmth.","stock":17,"category":"Men Fashion","price":840},
  {"title":"Orbit Recycled Trainers","description":"Upper made from recycled knit fibers. Bio-based cushioning derived from algae. Lightweight and breathable for everyday wear.","stock":55,"category":"Men Fashion","price":330},
  {"title":"Meadow Organic Rugby Shirt","description":"Heavyweight organic cotton knit. Naturally dyed in classic stripes. Reinforced collar for durability.","stock":48,"category":"Men Fashion","price":240},
  {"title":"Tide Hemp Cargo Trousers","description":"Durable hemp-cotton blend fabric. Naturally breathable and abrasion-resistant. Multiple utility pockets with clean tailoring.","stock":36,"category":"Men Fashion","price":365},
  {"title":"Cinder Merino Cardigan","description":"Fine-knit cardigan from ethically sourced merino wool. Buttoned front with minimalist detailing. Perfect for layering over shirts or tees.","stock":52,"category":"Men Fashion","price":410},
  {"title":"Harbor Recycled Swim Trunks","description":"Made from regenerated ocean plastic. Quick-dry finish with mesh lining. Eco-friendly dyeing process reduces water use.","stock":92,"category":"Men Fashion","price":175},
  {"title":"Summit Merino Hiking Socks","description":"Cushioned merino blend for comfort and durability. Naturally moisture-wicking and odor-resistant. Reinforced heel and toe for long wear.","stock":210,"category":"Men Fashion","price":65},
  {"title":"Basin Organic Cotton Blazer","description":"Unstructured blazer made from organic canvas. Naturally dyed with plant-based pigments. Lightweight and breathable for warmer climates.","stock":24,"category":"Men Fashion","price":560},
  {"title":"Echo Recycled Windbreaker","description":"Shell crafted from recycled polyester. Breathable mesh lining made from reclaimed fibers. Packable design for travel and commuting.","stock":60,"category":"Men Fashion","price":310},

  {"title":"Aurora Sculpted Blazer","description":"Precision-tailored from regenerative wool woven in boutique Italian mills. Plant-based dyes create a soft, dimensional matte finish. Feminine lines balance structure with fluidity for a modern silhouette.","stock":34,"category":"Womens fashion","price":460},
  {"title":"Seabreeze Linen Blouse","description":"Airy linen cultivated on water-efficient farms along the Mediterranean. Enzyme-softened without toxic treatments for breathable comfort. Subtle drape elevates both office and evening styling.","stock":62,"category":"Womens fashion","price":198},
  {"title":"Dawn Organic Jersey Tee","description":"Knitted from GOTS-certified organic cotton in small dye batches. Low-impact pigments minimize water and chemical use. Slightly fitted cut with a clean bateau neckline.","stock":128,"category":"Womens fashion","price":108},
  {"title":"Atlas Recycled Wool Trousers (W)","description":"Crafted from post-consumer recycled wool fibers. Tailored with a high-waisted, straight-leg profile. Breathable and wrinkle-resistant for all-day wear.","stock":44,"category":"Womens fashion","price":325},
  {"title":"Lark Hemp Shacket","description":"Mid-weight hemp twill with natural antimicrobial properties. Stonewashed with eco-enzymes for a broken-in handfeel. Designed to function as both shirt and light jacket.","stock":71,"category":"Womens fashion","price":275},
  {"title":"Frost Merino Rib Sweater","description":"Fine-gauge knit from ethically sourced merino yarns. Thermoregulating structure keeps warmth without bulk. Extended rib cuffs create a sculpted sleeve line.","stock":57,"category":"Womens fashion","price":355},
  {"title":"Pebblewash Denim Jacket (W)","description":"Low-impact, water-reduced denim construction. Indigo-free dyeing technology reduces chemical runoff. Classic cropped silhouette with sustainable metal buttons.","stock":41,"category":"Womens fashion","price":385},
  {"title":"Nimbus Recycled Puffer Vest (W)","description":"Insulated with recycled ocean plastic fibers. Lightweight yet exceptionally warm. Finished with a PFC-free water-repellent coating.","stock":30,"category":"Womens fashion","price":425},
  {"title":"Cedar Vegan Leather Loafers (W)","description":"Made from plant-based leather alternatives. Breathable lining crafted from recycled fibers. Elegant yet comfortable for daily wear.","stock":48,"category":"Womens fashion","price":295},
  {"title":"Verdant Bamboo Wide-Leg Pants","description":"Soft, breathable bamboo-blend fabric with natural stretch. Dyed using low-impact water-saving methods. Flowing silhouette suitable for work or leisure.","stock":75,"category":"Womens fashion","price":265},
  {"title":"Cascade Alpaca Wrap Coat","description":"Handwoven alpaca wool sourced from ethical cooperatives. Naturally insulating while remaining lightweight. Minimalist wrap design with hidden corozo buttons.","stock":19,"category":"Womens fashion","price":995},
  {"title":"Urban Recycled Knit Hoodie (W)","description":"Spun from recycled polyester and organic cotton. Soft brushed interior for maximum comfort. Relaxed fit with drop shoulders.","stock":108,"category":"Womens fashion","price":175},
  {"title":"Marina Tencel Polo Dress","description":"Made from sustainably harvested eucalyptus fibers. Naturally moisture-wicking and smooth to the touch. Smart-casual silhouette with a refined collar.","stock":86,"category":"Womens fashion","price":210},
  {"title":"Boreal Tailored Overcoat (W)","description":"Constructed from recycled wool blends. Wind-resistant lining made from recycled nylon. Streamlined, modern cut with clean lines.","stock":24,"category":"Womens fashion","price":780},
  {"title":"Sandrift Organic Joggers","description":"Premium loopback fabric made from organic cotton. Naturally dyed with minimal water usage. Relaxed fit with adjustable drawcord.","stock":138,"category":"Womens fashion","price":155},
  {"title":"Canopy Hemp Blazer (W)","description":"Lightweight blazer woven from hemp and organic cotton. Breathable and naturally wrinkle-resistant. Soft-shoulder construction for a contemporary look.","stock":36,"category":"Womens fashion","price":540},
  {"title":"Forge Reclaimed Denim Jeans (W)","description":"Made from reclaimed denim scraps re-spun into new yarn. Low-water finishing process reduces environmental impact. High-rise slim fit with classic styling.","stock":65,"category":"Womens fashion","price":295},
  {"title":"Seren Merino Scarf (W)","description":"Ultra-soft merino sourced from cruelty-free farms. Naturally dyed in earthy tones. Lightweight yet warm for versatile layering.","stock":145,"category":"Womens fashion","price":135},
  {"title":"Atlas Cork Belt (W)","description":"Made from sustainably harvested cork. Naturally flexible, durable, and water-resistant. Polished stainless buckle with minimalist design.","stock":98,"category":"Womens fashion","price":115},
  {"title":"Riverstone Linen Suit Set","description":"Breathable linen woven in artisanal mills. Naturally dyed using plant-based pigments. Relaxed tailoring perfect for summer formal wear.","stock":16,"category":"Womens fashion","price":1180},
  {"title":"Summit Recycled Parka (W)","description":"Shell made from recycled polyester bottles. Insulated with responsibly sourced down alternatives. PFC-free water-resistant finish.","stock":21,"category":"Womens fashion","price":910},
  {"title":"Harbor Organic Oxford Shirt (W)","description":"Classic button-down made from organic cotton oxford. Low-impact dyeing minimizes environmental footprint. Feminine fit with mother-of-pearl buttons.","stock":81,"category":"Womens fashion","price":225},
  {"title":"Sable Tencel Trench (W)","description":"Smooth, drapey fabric derived from sustainably managed forests. Naturally breathable with a subtle sheen. Double-breasted silhouette with recycled hardware.","stock":25,"category":"Womens fashion","price":960},
  {"title":"Prairie Wool Flannel Shirt (W)","description":"Soft brushed flannel made from recycled wool fibers. Naturally warm and breathable. Relaxed fit suitable for layering.","stock":59,"category":"Womens fashion","price":285},
  {"title":"Nimbus Lightweight Down Jacket (W)","description":"Filled with traceable, ethically sourced down. Shell made from recycled nylon. Slim, packable design for travel.","stock":29,"category":"Womens fashion","price":625},
  {"title":"Mesa Organic Cotton Chore Jacket (W)","description":"Durable canvas woven from organic fibers. Naturally dyed to reduce chemical waste. Multiple utility pockets with minimalist aesthetic.","stock":40,"category":"Womens fashion","price":410},
  {"title":"Delta Bamboo Sock Trio","description":"Made from breathable bamboo fibers with natural antibacterial properties. Reinforced heel and toe for longevity. Comes in neutral tones.","stock":230,"category":"Womens fashion","price":52},
  {"title":"Slate Recycled Nylon Bomber (W)","description":"Outer fabric made from regenerated fishing nets. Lightweight insulation for transitional weather. Ribbed trims for a clean finish.","stock":37,"category":"Womens fashion","price":495},
  {"title":"Lagoon Recycled Swim Set","description":"Fabric spun from reclaimed ocean plastic. Quick-drying with a soft, recycled mesh lining. Colored using water-minimizing dye processes.","stock":83,"category":"Womens fashion","price":195},
  {"title":"Granite Merino Knit Polo (W)","description":"Compact merino knit with structured rib collar. Naturally temperature-regulating and odor-resistant. Tailored slim fit for smart-casual styling.","stock":47,"category":"Womens fashion","price":370},
  {"title":"Valley Recycled Cotton Sweatshirt (W)","description":"Spun from pre-consumer cotton offcuts. Soft interior with a resilient outer face. Minimal branding keeps the design timeless.","stock":115,"category":"Womens fashion","price":178},
  {"title":"Sirocco Linen Palazzo Pants","description":"Breathable European linen with a fluid drape. Naturally dyed using low-water methods. Wide-leg cut with pressed center pleat.","stock":46,"category":"Womens fashion","price":335},
  {"title":"Canyon Suede Derby Shoes (W)","description":"Made from responsibly sourced suede. Vegetable-tanned leather lining for reduced chemical use. Cushioned insole for all-day comfort.","stock":29,"category":"Womens fashion","price":550},
  {"title":"Everlight Merino Base Layer (W)","description":"Ultra-fine merino wool knit for comfort. Naturally odor-resistant and moisture-wicking. Seamless construction to prevent chafing.","stock":90,"category":"Womens fashion","price":210},
  {"title":"Drift Organic Bucket Hat (W)","description":"Made from certified organic cotton twill. Naturally dyed in earth tones. Lightweight and packable for travel.","stock":150,"category":"Womens fashion","price":95},
  {"title":"Alpine Recycled Fleece Jacket (W)","description":"Fabric made from recycled plastic bottles. Soft, breathable, and highly insulating. Zippered pockets lined with recycled mesh.","stock":64,"category":"Womens fashion","price":340},
  {"title":"Harbor Knit Blazer (W)","description":"Knitted blazer made from organic cotton blend. Stretchy yet structured for comfort. Ideal for modern smart-casual dressing.","stock":26,"category":"Womens fashion","price":510},
  {"title":"Dune Organic Twill Shorts (W)","description":"Soft yet durable organic cotton twill. Naturally dyed with minimal water usage. Relaxed fit with reinforced stitching.","stock":101,"category":"Womens fashion","price":155},
  {"title":"Arbor Merino Beanie (W)","description":"Rib-knit beanie made from fine merino wool. Naturally insulating without overheating. Minimalist design with a rolled cuff.","stock":180,"category":"Womens fashion","price":85},
  {"title":"Horizon Tailored Vest (W)","description":"Made from recycled wool blends. Lined with breathable recycled polyester. Sharp tailoring suitable for layered formal looks.","stock":21,"category":"Womens fashion","price":260},
  {"title":"Vela Bamboo Lounge Set","description":"Silky bamboo fabric for natural temperature regulation. Hypoallergenic and gentle against the skin. Relaxed drape with minimalist detailing.","stock":72,"category":"Womens fashion","price":205},
  {"title":"Northwind Wool Peacoat (W)","description":"Constructed from recycled wool yarns. Double-breasted silhouette with durable corozo buttons. Fully lined with recycled fabric for warmth.","stock":17,"category":"Womens fashion","price":840},
  {"title":"Orbit Recycled Trainers (W)","description":"Upper made from recycled knit fibers. Bio-based cushioning derived from algae. Lightweight and breathable for everyday wear.","stock":55,"category":"Womens fashion","price":330},
  {"title":"Meadow Organic Rugby Shirt (W)","description":"Heavyweight organic cotton knit. Naturally dyed in classic stripes. Reinforced collar for durability.","stock":48,"category":"Womens fashion","price":240},
  {"title":"Tide Hemp Cargo Trousers (W)","description":"Durable hemp-cotton blend fabric. Naturally breathable and abrasion-resistant. Multiple utility pockets with clean tailoring.","stock":36,"category":"Womens fashion","price":365},
  {"title":"Cinder Merino Cardigan (W)","description":"Fine-knit cardigan from ethically sourced merino wool. Buttoned front with minimalist detailing. Perfect for layering over shirts or tees.","stock":52,"category":"Womens fashion","price":410},
  {"title":"Harbor Recycled Swim Trunks (W)","description":"Made from regenerated ocean plastic. Quick-dry finish with mesh lining. Eco-friendly dyeing process reduces water use.","stock":92,"category":"Womens fashion","price":175},
  {"title":"Summit Merino Hiking Socks (W)","description":"Cushioned merino blend for comfort and durability. Naturally moisture-wicking and odor-resistant. Reinforced heel and toe for long wear.","stock":210,"category":"Womens fashion","price":65},
  {"title":"Basin Organic Cotton Blazer (W)","description":"Unstructured blazer made from organic canvas. Naturally dyed with plant-based pigments. Lightweight and breathable for warmer climates.","stock":24,"category":"Womens fashion","price":560},
  {"title":"Echo Recycled Windbreaker (W)","description":"Shell crafted from recycled polyester. Breathable mesh lining made from reclaimed fibers. Packable design for travel and commuting.","stock":60,"category":"Womens fashion","price":310},
  {"title":"Lumen Tencel Dress Shirt","description":"Smooth, drapey fabric made from sustainably sourced wood pulp. Naturally breathable with a subtle sheen. Tailored fit with hidden placket.","stock":71,"category":"Womens fashion","price":280}
]
